const set = {
  person: [["Студент", "Преподаватель"]],
  faculty: [["ИФ", "ФПиП", "ИПКиП"], ["ФЭП", "ФСиГЯ"]],
  specialtys: {
    if: [["АТП", "А", "ИТвМ", "ИСТ"], ["МиМ", 'ПИТТ', "ТОСП", "ТО", "ТМ"]],
    fpip: [
      ["ГЭ", "ДО", "НО"],
      ["ОТИ", "ОП", "ПП"],
      ["СП", "СПД", "ТиМОВ", "ФК"]
    ],
    ipkap: [["БУ", "ДО", "ПД", "ПР"], ["ПП", "ПО", "ЭиУПП"]],
    fep: [["Б", "БА", "М", "ПХ"], ["ЭОП", "ЭТ", "ЭП", "ЭМ"]],
    fsigi: [["БИЯ", "ИЯ"], ["НА", 'РИЯ', "СИЯ"]],
  },
  groups: {
    // if
    atp: [["АТМз61"]],
    a: [["Ас11", "Ас21", "Ас31"], ["Азс11", "Азс21", "Азс31", "Азс41"]],
    itvm: [["ИТвМмз11"]],
    ist: [
      ["ИСТ11", "ИСТ12", "ИСТ21", "ИСТ22"],
      ["ИСТ31", "ИСТ41", "ИСТзс11"],
      ["ИСТзс21", "ИСТзс31", "ИСТзс41"]
    ],
    mim: [["МИМмз21"]],
    pitt: [["ПИТТ11"]],
    tosp: [
      ["ТОСП11", "ТОСП21", "ТОСП31"],
      ["ТОСП41", "ТОСПзс11", "ТОСПзс21"],
      ["ТОСПзс31", "ТОСПзс41"],
      ["ТОСПс11", "ТОСПс21", "ТОСПс31"]
    ],
    to: [["ТО41", "ТО51"]],
    tm: [
      ["ТМ11", "ТМ21", "ТМ31"],
      ["ТМ41", "ТМ51", "ТМз61"],
      ["ТМзс11", "ТМзс21"]
    ],
    // fpip
    ge: [["ГЭ11", "ГЭ21", "ГЭ31", "ГЭ41"]],
    do: [
      ["ДО11", "ДО21", "ДО31"],
      ["ДО41", "ДОз11", "ДОз21"],
      ["ДОз31", "ДОз41", "ДОз51"],
      ["ДОзс11", "ДОзс21", "ДОзс31", "ДОзсд11"]
    ],
    no: [["НО11", "НО21", "НО31"], ["НО41", "НОзс31"]],
    oti: [["ОТИ11", "ОТИ21", "ОТИ31", "ОТИ41"]],
    op: [["ОПмз21"]],
    pp: [
      ["ПП11", "ПП21", "ПП31"],
      ["ПП41", "ППз11", "ППз21"],
      ["ППз31", "ППз41", "ППз51"]
    ],
    sp: [["СП11", "СП21", "СП31", "СП41"]],
    spd: [["СПД11", "СПД21"]],
    timov: [["ТиМОВм11", "ТиМОВмз11", "ТМОВ11"]],
    fk: [["ФК11", "ФК21", "ФК31", "ФК41"]],
    // ipkap
    by: [["БУд218"]],
    i_do: [["ДОд218", "ДОз118", "ДОз217", "ДОз219"]],
    pd: [["ПДз118", "ПДз119"]],
    pr: [
      ["ПРд118", "ПРд119", "ПРд120"],
      ["ПРд219", "ПРз218", "ПРз219"]
    ],
    i_pp: [["ППз218", "ППз219"]],
    po: [["ПОз118", "ПОз219"]],
    eiynpp: [["Эд218", "Эд219"]],
    // fep
    b: [["Б31", "Б41"]],
    ba: [
      ["БА11", "БА21", "БА31", "БА41"],
      ["БАздс11", "БАздс21", "БАздс31"],
      ["БАзс11", "БАзс21", "БАзс31"]
    ],
    m: [
      ["М41", "Мзд41"],
      ["Мздс11", "Мздс21", "Мздс31"],
      ["Мзс11", "Мзс21", "Мзс31"]
    ],
    ph: [
      ["ПХ11", "ПХ21", "ПХ22"],
      ["ПХ31", "ПХ32", "ПХ41"],
      ["ПХ42", "ПХз11", "ПХз21"],
      ["ПХз22", "ПХз31", "ПХз32"],
      ["ПХз41", "ПХз51", "ПХздс31"],
      ["ПХзс11", "ПХзс21", "ПХзс31"]
    ],
    eop: [
      ["ЭОП31", "ЭОП41", "ЭОП51"],
      ["ЭОПз61", "ЭОПзс31", "ЭОПзс41"]
    ],
    et: [["ЭТ41"]],
    ep: [["ЭП11", "ЭП21", "ЭП31", "ЭП41"]],
    em: [["ЭМ11", "ЭМ21", "ЭМ31", "ЭМ41"]],
    // fsigi
    biya: [["БИЯ11", "БИЯ21", "БИЯ31", "БИЯ41"]],
    iya: [["ИЯ11", "ИЯ21", "ИЯ22"], ["ИЯ31", "ИЯ32", "ИЯ41", "ИЯ42"]],
    na: [["НА11", "НА21", "НА31"]],
    riya: [["РИЯ11"]],
    siya: [
      ["СИЯ11", "СИЯ12", "СИЯ13"],
      ["СИЯ21", "СИЯ22", "СИЯ23"],
      ["СИЯ31", "СИЯ32", "СИЯ33"],
      ["СИЯ41", "СИЯ42", "СИЯ43"]
    ],
  },
};

module.exports.person = set.person;
module.exports.faculty = set.faculty;
module.exports.specialtys = set.specialtys;
module.exports.groups = set.groups;
