const set = {
  person: [["Студент", "Преподаватель"]],
  faculty: [["ИФ", "ФПиП", "ИПКиП"], ["ФЭП", "ФСиГЯ"]],
  specialtys: {
    if: [["А", "ИТвМ", "ИСТ"], ['ПИТТ', "ТОСП", "ТО", "ТМ"]],
    fpip: [
      ["ГЭ", "ДО", "НО"],
      ["ОТИ", "ПП", "СП"],
      ["СПД", "ТМОВ", "ФК"]
    ],
    ipkap: [["ДО", "ПД", "ПП"], ["ПО", "ЭиУПП"]],
    fep: [["Б", "БА", "М", "ПХ"], ["ЭОП", "ЭП", "ЭМ"]],
    fsigi: [["БИЯ", "ИЯ"], ["НА", 'РИЯ', "СИЯ"]],
  },
  groups: {
    // if
    a: [["Ас11", "Ас21", "Ас31","Азс11"]],
    itvm: [["ИТМмз11"]],
    ist: [
      ["ИСТ11", "ИСТ21", "ИСТ22"],
      ["ИСТ31", "ИСТ41", 'ИСТзс31'],
    ],
    pitt: [["ПИТТ11"]],
    tosp: [
      ["ТОСП11", "ТОСП21", "ТОСП31","ТОСП41"],
      ["ТОСПс21", "ТОСПзс11", "ТОСПзс41"],
    ],
    to: [["ТО51"]],
    tm: [
      ["ТМ11", "ТМ21", "ТМ31"],
      ["ТМ41", "ТМ51", "ТМзc11"],
    ],
    // fpip
    ge: [["ГЭ11", "ГЭ21", "ГЭ31", "ГЭ41"]],
    do: [
      ["ДО11", "ДО21", "ДО31"],
      ["ДО41", "ДОз11", "ДОз51"],
      ["ДОзс11", "ДОзсд11"]
    ],
    no: [["НО11", "НО21", "НО31", "НО41"]],
    oti: [["ОТИ11", "ОТИ21", "ОТИ31", "ОТИ41"]],
    pp: [
      ["ПП11", "ПП21", "ПП31"],
      ["ПП41", "ППз11", "ППз51"],
    ],
    sp: [["СП11", "СП21", "СП31", "СП41"]],
    spd: [["СПД11", "СПД21"]],
    timov: [["ТМОВ11", "ТМОВз11"]],
    fk: [["ФК11", "ФК21", "ФК31", "ФК41"]],
    // ipkap
    i_do: [["ДОд218"]],
    pd: [["ПДз119"]],
    i_pp: [["ППз218", "ППз219"]],
    po: [["ПОз219"]],
    eiynpp: [["Эд219"]],
    // fep
    b: [["Б41"]],
    ba: [
      ["БА11", "БА21", "БА31", "БА41"],
      ["БАзс11", "БАздс21", "БАздс31"],
    ],
    m: [
      ["Мзс11", "Мздс11", "Мздс21", "Мздс31"],
    ],
    ph: [
      ["ПХ11", "ПХ21", "ПХ31"],
      ["ПХ32", "ПХ41", "ПХ42"],
      ["ПХз11","ПХз32", "ПХз41",],
      ["ПХз42", "ПХзс11", "ПХздс11"],
    ],
    eop: [
      ["ЭОП41", "ЭОП51"],
    ],
    ep: [["ЭП11", "ЭП21", "ЭП31"]],
    em: [["ЭМ11", "ЭМ21", "ЭМ31", "ЭМ41"]],
    // fsigi
    biya: [["БИЯ11", "БИЯ21", "БИЯ31", "БИЯ41"]],
    iya: [["ИЯ11", "ИЯ21","ИЯ31"], ["ИЯ32", "ИЯ41", "ИЯ42"]],
    na: [["НА11", "НА21", "НА31"]],
    riya: [["РИЯ11"]],
    siya: [
      ["СИЯ11", "СИЯ12", "СИЯ13"],
      ["СИЯ21", "СИЯ22", "СИЯ23"],
      ["СИЯ31", "СИЯ32", "СИЯ33"],
      ["СИЯ41", "СИЯ42", "СИЯ43"]
    ],
  },
};

module.exports.person = set.person;
module.exports.faculty = set.faculty;
module.exports.specialtys = set.specialtys;
module.exports.groups = set.groups;
