const groupsHook = ({specialty, faculty}) => {
  if (specialty === "А" && faculty === 'ИФ') {
    return [/(?:Ас11|Ас21|Ас31|Азс11)/, 'a'];
  }
  if (specialty === "ИТвМ" && faculty === 'ИФ') {
    return [/(?:ИТМмз11)/, 'itvm'];
  }
  if (specialty === "ИСТ" && faculty === 'ИФ') {
    return [/(?:ИСТ11|ИСТ21|ИСТ22|ИСТ31|ИСТ41|ИСТзс31)/, 'ist'];
  }
  if (specialty === "ПИТТ" && faculty === 'ИФ') {
    return [/(?:ПИТТ11)/, 'pitt'];
  }
  if (specialty === "ТОСП" && faculty === 'ИФ') {
    return [/(?:ТОСП11|ТОСП21|ТОСП31|ТОСП41|ТОСПзс41|ТОСПс21)/, 'tosp'];
  }
  if (specialty === "ТО" && faculty === 'ИФ') {
    return [/(?:ТО51)/, 'to'];
  }
  if (specialty === "ТМ" && faculty === 'ИФ') {
    return [/(?:ТМ11|ТМ21|ТМ31|ТМ41|ТМ51|ТМзс11)/, 'tm'];
  }
  if (specialty === "ГЭ" && faculty === 'ФПиП') {
    return [/(?:ГЭ11|ГЭ21|ГЭ31|ГЭ41)/, 'ge'];
  }
  if (specialty === "ДО" && faculty === 'ФПиП') {
    return [/(?:ДО11|ДО21|ДО31|ДО41|ДОз11|ДОз51|ДОзс11|ДОзсд11)/, 'do'];
  }
  if (specialty === "НО" && faculty === 'ФПиП') {
    return [/(?:НО11|НО21|НО31|НО41)/, 'no'];
  }
  if (specialty === "ОТИ" && faculty === 'ФПиП') {
    return [/(?:ОТИ11|ОТИ21|ОТИ31|ОТИ41)/, 'oti'];
  }
  if (specialty === "ПП" && faculty === 'ФПиП') {
    return [/(?:ПП11|ПП21|ПП31|ПП41|ППз11|ППз51)/, 'pp'];
  }
  if (specialty === "СП" && faculty === 'ФПиП') {
    return [/(?:СП11|СП21|СП31|СП41)/, 'sp'];
  }
  if (specialty === "СПД" && faculty === 'ФПиП') {
    return [/(?:СПД11|СПД21)/, 'spd'];
  }
  if (specialty === "ТМОВ" && faculty === 'ФПиП') {
    return [/(?:ТМОВ11|ТМОВз11)/, 'timov'];
  }
  if (specialty === "ФК" && faculty === 'ФПиП') {
    return [/(?:ФК11|ФК21|ФК31|ФК41)/, 'fk'];
  }
  if (specialty === "БУ" && faculty === 'ИПКиП') {
    return [/(?:БУд218)/, 'by'];
  }
  if (specialty === "ДО" && faculty === 'ИПКиП') {
    return [/(?:ДОд218)/, 'i_do'];
  }
  if (specialty === "ПД" && faculty === 'ИПКиП') {
    return [/(?:ПДз119)/, 'pd'];
  }
  if (specialty === "ПП" && faculty === 'ИПКиП') {
    return [/(?:ППз218|ППз219)/, 'i_pp'];
  }
  if (specialty === "ПО" && faculty === 'ИПКиП') {
    return [/(?:ПОз219)/, 'po'];
  }
  if (specialty === "ЭиУПП" && faculty === 'ИПКиП') {
    return [/(?:Эд219)/, 'eiynpp'];
  }
  if (specialty === "Б" && faculty === 'ФЭП') {
    return [/(?:Б41)/, 'b'];
  }
  if (specialty === "БА" && faculty === 'ФЭП') {
    return [/(?:БА11|БА21|БА31|БА41|БАзс11|БАздс21|БАздс31)/, 'ba'];
  }
  if (specialty === "М" && faculty === 'ФЭП') {
    return [/(?:Мзс11|Мздс11|Мздс21|Мздс31|)/, 'm'];
  }
  if (specialty === "ПХ" && faculty === 'ФЭП') {
    return [/(?:ПХ11|ПХ21|ПХ31|ПХ32|ПХ41|ПХ42|ПХз11|ПХз32|ПХз41|ПХз42|ПХздс11|ПХзс11|ПХзс31)/, 'ph'];
  }
  if (specialty === "ЭОП" && faculty === 'ФЭП') {
    return [/(?:ЭОП41|ЭОП51)/, 'eop'];
  }
  if (specialty === "ЭП" && faculty === 'ФЭП') {
    return [/(?:ЭП11|ЭП21|ЭП31)/, 'ep'];
  }
  if (specialty === "ЭМ" && faculty === 'ФЭП') {
    return [/(?:ЭМ11|ЭМ21|ЭМ31|ЭМ41)/, 'em'];
  }
  if (specialty === "БИЯ" && faculty === 'ФСиГЯ') {
    return [/(?:БИЯ11|БИЯ21|БИЯ31|БИЯ41)/, 'biya'];
  }
  if (specialty === "ИЯ" && faculty === 'ФСиГЯ') {
    return [/(?:ИЯ11|ИЯ21|ИЯ31|ИЯ32|ИЯ41|ИЯ42)/, 'iya'];
  }
  if (specialty === "НА" && faculty === 'ФСиГЯ') {
    return [/(?:НА11|НА21|НА31)/, 'na'];
  }
  if (specialty === "РИЯ" && faculty === 'ФСиГЯ') {
    return [/(?:РИЯ11)/, 'riya'];
  }
  if (specialty === "СИЯ" && faculty === 'ФСиГЯ') {
    return [/(?:СИЯ11|СИЯ12|СИЯ13|СИЯ21|СИЯ22|СИЯ23|СИЯ31|СИЯ32|СИЯ33|СИЯ41|СИЯ42|СИЯ43)/, 'siya'];
  }
};

module.exports = groupsHook;


module.exports.autobusPlacesHook = (autobus) => {
  if(autobus === '6') {
    return /(?:Cквер Героя Карвата|К-т пищевых продуктов|Станция переливания крови|ул.50 лет ВЛКСМ|ул.Вишневая|м-н "Алеся"|ул.Коммунистическая|ул.Курчатова|Дом школьника|Cквер Памяти|Выставочный зал|ул.Красноармейская|ТЭЦ|Завод Станкопринадлежностей|ул.Промышленная|БЗАЛ|Электросети|Завод ЖБК|Завод ЖБИ|БПХО|ул.Фабричная|сш №15|пр.Машерова)/
  }
  if(autobus === '14') {
    return /(?:Автодром|ОПМС-115|Посёлок Пригородный|Лицей строителей|2-е третьяки|1-е третьяки|Депо|Лечебно конс-ая пол-ка|Мясокомбинат|Стройтрест|ул.Гагарина|Площадь имени Ленина|Швейная фабрика|Стадион|Автовокзал|ул.Тельмана|Поселковая|ул.Циолковского|ул.Новаторов|ТД "ДДМ")/
  }
  if(autobus === '29') {
    return /(?:Берёзовая|ул.Домейко|ул.Скорины|ул.Андреева|м-н Боровки|Молочный комбинат|Комбинат Хлебопродуктов|Мясокомбинат|Стройтрест|ул.Гагарина|Площадь имени Ленина|Швейная фабрика|Стадион|Автовокзал|ул.Тельмана|ул.Поселковая|ул.Циолковского|ул.Новаторов|ТД "ДДМ")/
  }
  if(autobus === '31') {
    return /(?:Сквер Героя Карвата|ул.Рокоссовского|Стадион|Жд вокзал "Полесский"|ул.Тельмана|ул.Поселковая|ул.Циолковского|ул.Наваторов|ТД ДДМ)/
  }
}

