const groupsHook = ({specialty, faculty}) => {
  if (specialty === "АТП" && faculty === 'ИФ') {
    return [/(?:АТМз61)/, 'atp'];
  }
  if (specialty === "А" && faculty === 'ИФ') {
    return [/(?:Ас11|Ас21|Ас31|Азс11|Азс21|Азс31|Азс41)/, 'a'];
  }
  if (specialty === "ИТвМ" && faculty === 'ИФ') {
    return [/(?:ИТвМмз11)/, 'itvm'];
  }
  if (specialty === "ИСТ" && faculty === 'ИФ') {
    return [/(?:ИСТ11|ИСТ12|ИСТ21|ИСТ22|ИСТ31|ИСТ41|ИСТзс11|ИСТзс21|ИСТзс31|ИСТзс41)/, 'ist'];
  }
  if (specialty === "МиМ" && faculty === 'ИФ') {
    return [/(?:МИМмз21)/, 'mim'];
  }
  if (specialty === "ПИТТ" && faculty === 'ИФ') {
    return [/(?:ПИТТ11)/, 'pitt'];
  }
  if (specialty === "ТОСП" && faculty === 'ИФ') {
    return [/(?:ТОСП11|ТОСП21|ТОСП31|ТОСП41|ТОСПзс11|ТОСПзс21|ТОСПзс31|ТОСПзс41|ТОСПс11|ТОСПс21|ТОСПс31)/, 'tosp'];
  }
  if (specialty === "ТО" && faculty === 'ИФ') {
    return [/(?:ТО41|ТО51)/, 'to'];
  }
  if (specialty === "ТМ" && faculty === 'ИФ') {
    return [/(?:ТМ11|ТМ21|ТМ31|ТМ41|ТМ51|ТМз61|ТМзс11|ТМзс21)/, 'tm'];
  }
  if (specialty === "ГЭ" && faculty === 'ФПиП') {
    return [/(?:ГЭ11|ГЭ21|ГЭ31|ГЭ41)/, 'ge'];
  }
  if (specialty === "ДО" && faculty === 'ФПиП') {
    return [/(?:ДО11|ДО21|ДО31|ДО41|ДОз11|ДОз21|ДОз31|ДОз41|ДОз51|ДОзс11|ДОзс21|ДОзс31|ДОзсд11)/, 'do'];
  }
  if (specialty === "НО" && faculty === 'ФПиП') {
    return [/(?:НО11|НО21|НО31|НО41|НОзс31)/, 'no'];
  }
  if (specialty === "ОТИ" && faculty === 'ФПиП') {
    return [/(?:ОТИ11|ОТИ21|ОТИ31|ОТИ41)/, 'oti'];
  }
  if (specialty === "ОП" && faculty === 'ФПиП') {
    return [/(?:ОПмз21)/, 'op'];
  }
  if (specialty === "ПП" && faculty === 'ФПиП') {
    return [/(?:ПП11|ПП21|ПП31|ПП41|ППз11|ППз21|ППз31|ППз41|ППз51)/, 'pp'];
  }
  if (specialty === "СП" && faculty === 'ФПиП') {
    return [/(?:СП11|СП21|СП31|СП41)/, 'sp'];
  }
  if (specialty === "СПД" && faculty === 'ФПиП') {
    return [/(?:СПД11|СПД21)/, 'spd'];
  }
  if (specialty === "ТиМОВ" && faculty === 'ФПиП') {
    return [/(?:ТиМОВм11|ТиМОВмз11|ТМОВ11)/, 'timov'];
  }
  if (specialty === "ФК" && faculty === 'ФПиП') {
    return [/(?:ФК11|ФК21|ФК31|ФК41)/, 'fk'];
  }
  if (specialty === "БУ" && faculty === 'ИПКиП') {
    return [/(?:БУд218)/, 'by'];
  }
  if (specialty === "ДО" && faculty === 'ИПКиП') {
    return [/(?:ДОд218|ДОз118|ДОз217|ДОз219)/, 'i_do'];
  }
  if (specialty === "ПД" && faculty === 'ИПКиП') {
    return [/(?:ПД118|ПДз119)/, 'pd'];
  }
  if (specialty === "ПР" && faculty === 'ИПКиП') {
    return [/(?:ПРд118|ПРд119|ПРд120|ПРд219|ПРз218|ПРз219)/, 'pr'];
  }
  if (specialty === "ПП" && faculty === 'ИПКиП') {
    return [/(?:ППз218|ППз219)/, 'i_pp'];
  }
  if (specialty === "ПО" && faculty === 'ИПКиП') {
    return [/(?:ПОз118|ПОз219)/, 'po'];
  }
  if (specialty === "ЭиУПП" && faculty === 'ИПКиП') {
    return [/(?:Эд218|Эд219)/, 'eiynpp'];
  }
  if (specialty === "Б" && faculty === 'ФЭП') {
    return [/(?:Б31|Б41)/, 'b'];
  }
  if (specialty === "БА" && faculty === 'ФЭП') {
    return [/(?:БА11|БА21|БА31|БА41|БАздс11|БАздс21|БАздс31|БАзс11|БАзс21|БАзс31)/, 'ba'];
  }
  if (specialty === "М" && faculty === 'ФЭП') {
    return [/(?:М41|Мзд41|Мздс11|Мздс21|Мздс31|Мзс11|Мзс21|Мзс31)/, 'm'];
  }
  if (specialty === "ПХ" && faculty === 'ФЭП') {
    return [/(?:ПХ11|ПХ21|ПХ22|ПХ31|ПХ31|ПХ41|ПХ42|ПХз11|ПХз21|ПХз22|ПХз31|ПХз32|ПХз41|ПХз51|ПХздс31|ПХзс11|ПХзс21|ПХзс31)/, 'ph'];
  }
  if (specialty === "ЭОП" && faculty === 'ФЭП') {
    return [/(?:ЭОП31|ЭОП41|ЭОП51|ЭОПз61|ЭОПзс31|ЭОПзс41)/, 'eop'];
  }
  if (specialty === "ЭТ" && faculty === 'ФЭП') {
    return [/(?:ЭТ41)/, 'et'];
  }
  if (specialty === "ЭП" && faculty === 'ФЭП') {
    return [/(?:ЭП11|ЭП21|ЭП31|ЭП41)/, 'ep'];
  }
  if (specialty === "ЭМ" && faculty === 'ФЭП') {
    return [/(?:ЭМ11|ЭМ21|ЭМ31|ЭМ41)/, 'em'];
  }
  if (specialty === "БИЯ" && faculty === 'ФСиГЯ') {
    return [/(?:БИЯ11|БИЯ21|БИЯ31|БИЯ41)/, 'biya'];
  }
  if (specialty === "ИЯ" && faculty === 'ФСиГЯ') {
    return [/(?:ИЯ11|ИЯ21|ИЯ22|ИЯ31|ИЯ32|ИЯ41|ИЯ42)/, 'iya'];
  }
  if (specialty === "НА" && faculty === 'ФСиГЯ') {
    return [/(?:НА11|НА21|НА31)/, 'na'];
  }
  if (specialty === "РИЯ" && faculty === 'ФСиГЯ') {
    return [/(?:РИЯ11)/, 'riya'];
  }
  if (specialty === "СИЯ" && faculty === 'ФСиГЯ') {
    return [/(?:СИЯ11|СИЯ12|СИЯ13|СИЯ21|СИЯ22|СИЯ23|СИЯ31|СИЯ32|СИЯ33|СИЯ41|СИЯ42|СИЯ43)/, 'siya'];
  }
};

module.exports = groupsHook;


module.exports.autobusPlacesHook = (autobus) => {
  if(autobus === '6') {
    return /(?:Cквер Героя Карвата|К-т пищевых продуктов|Станция переливания крови|ул.50 лет ВЛКСМ|ул.Вишневая|м-н "Алеся"|ул.Коммунистическая|ул.Курчатова|Дом школьника|Cквер Памяти|Выставочный зал|ул.Красноармейская|ТЭЦ|Завод Станкопринадлежностей|ул.Промышленная|БЗАЛ|Электросети|Завод ЖБК|Завод ЖБИ|БПХО|ул.Фабричная|сш №15|пр.Машерова)/
  }
  if(autobus === '11') {
    return /(?:БПХО|ул.Фабричная|Школа № 15|пр.Машерова)/
  }
  if(autobus === '14') {
    return /(?:Автодром|ОПМС-115|Посёлок Пригородный|Лицей строителей|2-е третьяки|1-е третьяки|Депо|Лечебно конс-ая пол-ка|Мясокомбинат|Стройтрест|ул.Гагарина|Площадь имени Ленина|Швейная фабрика|Стадион|Автовокзал|ул.Тельмана|Поселковая|ул.Циолковского|ул.Новаторов|ТД "ДДМ")/
  }
  if(autobus === '22') {
    return /(?:Автобусный парк|ул.Циолковского|ул.Новаторов|ТД ДДМ)/
  }
  if(autobus === '29') {
    return /(?:Берёзовая|ул.Домейко|ул.Скорины|ул.Андреева|м-н Боровки|Молочный комбинат|Комбинат Хлебопродуктов|Мясокомбинат|Стройтрест|ул.Гагарина|Площадь имени Ленина|Швейная фабрика|Стадион|Автовокзал|ул.Тельмана|ул.Поселковая|ул.Циолковского|ул.Новаторов|ТД "ДДМ")/
  }
  if(autobus === '31') {
    return /(?:Сквер Героя Карвата|ул.Рокоссовского|Стадион|Жд вокзал "Полесский"|ул.Тельмана|ул.Поселковая|ул.Циолковского|ул.Наваторов|ТД ДДМ)/
  }
}

